xml cf/InformationRegisters/ДескрипторыОбъектовДляВыгрузкиГалактика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ДескрипторыОбъектовДляВыгрузкиГалактика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>F_DESGR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml cf/InformationRegisters/ДескрипторыОбъектовДляВыгрузкиГалактика/Forms/ФормаУстановкиДескриптора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбъектыНазначения") Тогда
		ОбъектыНазначения.ЗагрузитьЗначения(Параметры.ОбъектыНазначения);
	КонецЕсли;
	
	Если ОбъектыНазначения.Количество() Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОбъектыНазначения", ОбъектыНазначения.ВыгрузитьЗначения());
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДескрипторыОбъектовДляВыгрузкиГалактика.F_DESGR КАК Дескриптор
		|ИЗ
		|	РегистрСведений.ДескрипторыОбъектовДляВыгрузкиГалактика КАК ДескрипторыОбъектовДляВыгрузкиГалактика
		|ГДЕ
		|	ДескрипторыОбъектовДляВыгрузкиГалактика.Объект В(&ОбъектыНазначения)";
		
		Дескрипторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Дескриптор");
		Если Дескрипторы.Количество() = 1 Тогда
			Дескриптор = Дескрипторы.Получить(0);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДескрипторНаСервере()
	
	СтруктураЗаписи = Новый Структура("Объект, F_DESGR", Неопределено, ЭтотОбъект.Дескриптор);
	Для Каждого ТекОбъект Из ОбъектыНазначения Цикл
		СтруктураЗаписи.Объект = ТекОбъект.Значение; 
		РегистрыСведений.ДескрипторыОбъектовДляВыгрузкиГалактика.ДобавитьЗапись(СтруктураЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДескриптор(Команда)
	
	УстановитьДескрипторНаСервере();
	Закрыть();
	
КонецПроцедуры
